driver-tests/bpelse/assign/AssignJbi/test/echoLongDataType_Invoke/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://stc.com/echoLongDataType">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <item xmlns="http://stc.com/echoLongDataType">
    <string>10</string>
    <normalizedString>10</normalizedString>
    <token>10</token>
    <base64Binary>10</base64Binary>
    <hexBinary>10</hexBinary>
    <integer>10</integer>
    <positiveInteger>10</positiveInteger>
    <negativeInteger>10</negativeInteger>
    <nonNegativeInteger>10</nonNegativeInteger>
    <nonPositiveInteger>10</nonPositiveInteger>
    <long>10</long>
    <unsignedLong>10</unsignedLong>
    <int>10</int>
    <unsignedInt>10</unsignedInt>
    <short>10</short>
    <unsignedShort>10</unsignedShort>
    <byte>10</byte>
    <unsignedByte>10</unsignedByte>
    <decimal>10</decimal>
    <float>10</float>
    <double>10</double>
    <boolean>10</boolean>
    <duration>10</duration>
    <dateTime>10</dateTime>
    <date>10</date>
    <time>10</time>
    <gYear>10</gYear>
    <gYearMonth>10</gYearMonth>
    <gMonth>10</gMonth>
    <gMonthDay>10</gMonthDay>
    <gDay>10</gDay>
    <Name>10</Name>
    <QName>10</QName>
    <NCName>10</NCName>
    <anyURI>10</anyURI>
    <language>10</language>
    <ID>10</ID>
    <IDREF>10</IDREF>
    <IDREFS>10</IDREFS>
    <ENTITY>10</ENTITY>
    <ENTITIES>10</ENTITIES>
    <NMTOKEN>10</NMTOKEN>
    <NMTOKENS>10</NMTOKENS>
  </item>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
